{"data":{"site":{"siteMetadata":{"title":"Love Builds Here","author":"Adam and Karen Murray"}},"markdownRemark":{"id":"b550ce67-28e0-55ff-9fed-327302591702","excerpt":"It’s one of my favorite Switchfoot songs. A solid rock anthem, started with the lines: I MADE MY MISTAKES, I SEEN MY HEART CAVE IN, I GOT MY…","html":"<p>It’s one of my favorite Switchfoot songs. A solid rock anthem, started with the lines:</p>\n<blockquote>\n<p>I MADE MY MISTAKES, I SEEN MY HEART CAVE IN, I GOT MY SCARS, I BEEN TO HELL AND BACK AGAIN</p>\n</blockquote>\n<p>And I think it’s the story of most strong-willed men like myself. I didn’t fit. And sometimes, frankly, I still don’t. I was born to the beat of my own drum. But, I was made who I am by a God that knows what to do with someone like me, and that, my friends, gives me hope.</p>\n<p>I’m drawn to Psalm 32, one of the key passages for our church. In verse 9, David instructs the hearer:</p>\n<blockquote>\n<p>BE NOT LIKE A HORSE OR A MULE, WITHOUT UNDERSTANDING, WHICH MUST BE CURBED WITH BIT AND BRIDLE, OR\nIT WILL NOT STAY NEAR YOU.</p>\n</blockquote>\n<p>A few years ago, God gave me a picture. And the picture was of myself as a wild stallion (no, not the weird, romance novel type). The stallion is good and strong, but without training and guidance, he is limited in his usefulness. What the stallion needed was someone <strong>trusted</strong> to come alongside, and, together, what a force.</p>\n<p>Now, there are some interesting things in that picture. First, that word <strong>trust</strong> is key. The relationship between horse and rider is a deep one, and one that we see throughout history usually lasting throughout the life of one or the other. Think of great ancient generals, and chances are that you’ll see a specific horse in there somewhere. Second, both the rider and the horse are necessary. One without the other doesn’t make much sense.</p>\n<p>That draws us back to Psalm 32:7, where the writer indicates that rich, trusting relationship he has with the LORD:</p>\n<blockquote>\n<p>YOU ARE A HIDING PLACE FOR ME; YOU PRESERVE ME FROM TROUBLE; YOU SURROUND ME WITH SHOUTS OF\nDELIVERANCE.</p>\n</blockquote>\n<p>Imagine that. <strong>The LORD, the God of promise and covenant, surrounds him with shouts of deliverance.</strong> That verse shouts trust and faith. How did he get there though? Does it just happen? Look back even further at verses 3-6:</p>\n<blockquote>\n<p>FOR WHEN I KEPT SILENT, MY BONES WASTED AWAY THROUGH MY GROANING ALL DAY LONG. FOR DAY AND NIGHT\nYOUR HAND WAS HEAVY UPON ME; MY STRENGTH WAS DRIED UP AS BY THE HEAT OF SUMMER.\nI ACKNOWLEDGED MY SIN TO YOU, AND I DID NOT COVER MY INIQUITY; I SAID, “I WILL CONFESS MY\nTRANSGRESSIONS TO THE LORD,” AND YOU FORGAVE THE INIQUITY OF MY SIN.</p>\n</blockquote>\n<p>The writer had come to know God <strong>through a relationship over time</strong>, that involved a deep realization of who he was and who God was. An understanding of his sin and the effects of it, and an understanding of a God that is there even when we are silent, but who is willing to forgive all of the shame, guilt and evil of our sin the moment that we confess.</p>\n<p>It is that relationship and understanding that draws the writer to trust and enjoy the steadfast love of the Lord, and to instruct others to do the same (verses 6,8,9). These are the people that are truly blessed (verses 1-2).</p>\n<p>There is no other way. Trust. Live a life of confession and openness before Him. If you trust Him, his steadfast love will surround you, and you will be blessed. 1 John 1:9 would echo this: <strong>“If we confess our sins, he is faithful and just to forgive us our sins and to cleanse us from all unrighteousness.”</strong></p>\n<p>May we that are strong men embrace who we are, but not be like stubborn horses or mules. May we instead draw near to the Master, and trust Him by being quick to confess, and quick to open ourselves before Him who sees us exactly as we are anyways. And, as we do that, may we hear His shouts of deliverance over us, feel the warmth of His steadfast love, and know His protection that keeps us from trouble.</p>","frontmatter":{"title":"Dark Horses","date":"April 01, 2016"}}},"pageContext":{"slug":"/dark-horses/","previous":null,"next":{"fields":{"slug":"/people-of-the-new-day/"},"frontmatter":{"title":"People of the New Day"}}}}