{"data":{"contentfulPost":{"title":"Psalm 78: 1-4","body":{"childContentfulRichText":{"html":"<p><i>Give ear, O my people, to my teaching;</i></p><p><i>incline your ears to the words of my mouth!</i></p><p> <i>I will open my mouth in a parable;</i></p><p><i>I will utter dark sayings from of old,</i></p><p> <i>things that we have heard and known,</i></p><p><i>that our fathers have told us.</i></p><p> <i>We will not hide them from their children,</i></p><p><i>but tell to the coming generation</i></p><p><i>the glorious deeds of the LORD, and his might,</i></p><p><i>and the wonders that he has done.</i></p><p> </p><p><i>Psalm 78: 1-4</i></p><p></p><p>I love a good story, and I think, in reality, everyone does. We celebrate authors, playwrights, and directors because of their ability to entertain us and transport us to other places and times. Song writers and poets are lifted high because of their ability to convey truth, creativity, and emotion in small sound-bites. </p><p> But what if the most amazing stories lived inside the humble, the shy, the mustard seeds of the world? What if the most powerful, transformational stories were waiting to be told by you? </p><p>It’s evident that we are storytellers, each and every one of us. Don’t believe me? Just look at the explosion of Facebook, Twitter, Instagram, and others over the last decade. Billions of people tell their stories every day to anyone that will listen. </p><p>Maybe you hear fiction or tale when you read the word <i>story</i>, but let me ask you to expand that to another definition - <i>an account of incidents or events.</i> We all engage with those stories on a daily basis. With those stories, we also communicate so much more than words. For thousands and thousands of years, stories have communicated things like: beliefs, values, and ethics. We tell our stories from our personal understanding, and pass that personal, unique understanding to others. </p><p>That brings us back to the Psalm. Our stories about God and His actions in our lives not only affect us, but those that come long after us. The hearer is instructed not to hide them (v.4), but to tell them to the next generation and continue the line of storytelling passed down from before (v.3). </p><p> I believe the Church needs to recapture its stories, and that each local church should actively engage in telling of His glorious works in the midst of its people (v.4)</p>"}}}},"pageContext":{"id":"psalm-78-1-4","previous":{"title":"People of the New Day","slug":"people-of-the-new-day","excerpt":{"excerpt":"One morning last week, I woke up around 5:45am. The sky was just starting to change from dark to light, and my mind immediately went to the story of the Resurrection, and the symbolism of the Gospel passages. "}},"next":null}}