{"data":{"site":{"siteMetadata":{"title":"Love Builds Here","description":"Helpful parenting tips, house projects, and anything else along the way that helps us grow to love more."}},"allContentfulPost":{"edges":[{"node":{"title":"Psalm 78: 1-4","body":{"childContentfulRichText":{"html":"<p><i>Give ear, O my people, to my teaching;</i></p><p><i>incline your ears to the words of my mouth!</i></p><p> </p><p><i>I will open my mouth in a parable;</i></p><p><i>I will utter dark sayings from of old,</i></p><p> </p><p><i>things that we have heard and known,</i></p><p><i>that our fathers have told us.</i></p><p> </p><p><i>We will not hide them from their children,</i></p><p><i>but tell to the coming generation</i></p><p><i>the glorious deeds of the LORD, and his might,</i></p><p><i>and the wonders that he has done.</i></p><p> </p><p><i>Psalm 78: 1-4</i></p>"}}}},{"node":{"title":"People of the New Day","body":{"childContentfulRichText":{"html":"<blockquote><p><i>But on the first day of the week, at early dawn, they went to the tomb, taking the spices they had prepared. - Luke 24:1</i></p></blockquote><p>\nOne morning last week, I woke up around 5:45am. The sky was just starting to change from dark to light, and my mind immediately went to the story of the Resurrection, and the symbolism of the Gospel passages. Matthew says it was “toward the dawn”, Mark says it was “very early”, Luke says it was “early dawn”, and John says “while it was still dark”. In Revelation 22:16, we hear Jesus say, “‘I, Jesus, have sent my angel to testify to you about these things for the churches. I am the root and the descendant of David, the bright morning star.&#39;”.</p><p>\nIt’s impossible to miss. His resurrection points to daybreak. The night is over. Paul says in Romans 13:12,\n</p><blockquote><p><i>The night is far gone; the day is at hand. So then let us cast off the works of darkness and put on the armor of light.</i></p></blockquote><p>\nWe are people of the new day. In Romans, we see that in light of the new day, we are also called to “cast off the works of darkness and put on the armor of light”. We do that through understanding the time we now live in, walking like we should as new people (v.13), and constantly putting on Jesus (v.14), or abiding in Him (remember John 15?).</p><p>\nEach day is not just another day. It is the passing of time that sees the sun break a little more over the horizon. Let us live like people of the new day.\n</p>"}}}}]}},"pageContext":{}}